_orgs/_posts/linux/2018-04-03-linux-cli-and-shell.org
#+TITLE:     《Linux 命令行与 Shell 编程大全》阅读笔记
#+AUTHOR:    zrg
#+EMAIL:     zrg1390556487@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:plain toc:t ltoc:t mouse:underline buttons:0 path:http://cs3.swfc.edu.cn/~20121156044/.org-info.js />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://cs3.swfu.edu.cn/~20121156044/.org-manual.css" />
#+HTML_HEAD: <style>body {font-size:14pt} code {font-weight:bold;font-size:100%; color:darkblue}</style>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT: 

#+BEGIN_EXPORT HTML
---
layout: post
title: 《Linux 命令行与 Shell 编程大全》阅读笔记
author: zrg
comments: false
description: 命令行界面(command line interface，CLI)，Linux，Shell
categories:
- linux
- shell
tags:
- Shell
photos:
---
#+END_EXPORT

# (setq org-export-html-use-infojs nil)
# (setq org-export-html-style nil)

* 前言(Preface)
+ 如何启动命令行以及接下来做什么？
+ 如何使用 shell脚本来自动处理系统管理任务，包括从检测系统统计数据和数据文件到为你的老板生成报表？
* Linux 命令行
** 初探 bash shell 命令
*** 学习 shell 开始
 1. 启动 shell
    - /bin/bash //重点讨论 GNU bash shell
 2. shell 提示符
    - 默认的 bash shell 提示符是美元符号 $，看起来是这样的：zrg@debian:~$
 3. bash 手册
    - man 命令用来访问存储在 Linux 系统上的手册页面。
 #+CAPTION: Linux 手册页惯用的节名
 $ man man
 | 节            | 描述                     |
 |---------------+--------------------------|
 | Name          | 显示命令和一段简短的描述 |
 | Synopsis      | 命令的语法               |
 | Configuration | 命令配置信息             |
 | Description   | 命令的一般性描述         |
 | Options       | 命令选项描述             |
 | Exit Status   | 命令的推出状态指示       |
 | Return Value  | 命令的返回值             |
 | Errors        | 命令的错误信息           |
 | Environment   | 描述所使用的环境变量     |
 | Files         | 命令用到的文件           |
 | Versions      | 命令的版本信息           |
 | Conforming To | 命令所遵从的标准         |
 | Notes         | 其他有帮助的资料         |
 | Bugs          | 提供提交Bug的途径        |
 | Example       | 展示命令的用法           |
 | Authors       | 命令开发人员的信息       |
 | Copyright     | 命令源代码的版权状况     |
 | See Also      | 与该命令类似的其他命令   |
 |---------------+--------------------------|
 : 如果不记得命令名怎么办？可以使用关键字搜索手册页。
 : $ man -k terminal
 #+CAPTION: Linux 手册页的内容区域
 | 区域号 | 所涵盖的内容             |
 |--------+--------------------------|
 |      1 | 可执行程序或shell命令    |
 |      2 | 系统调用                 |
 |      3 | 库调用                   |
 |      4 | 特殊文件                 |
 |      5 | 文件格式与约定           |
 |      6 | 游戏                     |
 |      7 | 概览、约定及杂项         |
 |      8 | 超级用户和系统管理员命令 |
 |      9 | 内核例程                 |
 |--------+--------------------------|
*** 文件、目录操作
    - cd
    - ls
    - touch
    - cp
    - mv
    - ln
    - rm
    - mkdir
    - rmdir
    - file
    - cat
    - more
    - less
    - tail
    - head
*** 进程、磁盘统计和管理
- ps -ef
- top
- kill
- killall
- mount
- umount
- df -h
- du
*** 排序、归档数据
- sort
- grep
- gzip
- gzcat
- gunzip
- tar
** 理解 shell
*** shell 类型
- /bin/bash
- /bin/tcsh
- /bin/dash
- /bin/csh
- /bin/sh
*** Shell 的父子关系
**** 理解
: $ ps -f
 UID        PID  PPID  C STIME TTY          TIME CMD
 zrg      25305  4834  8 23:51 pts/4    00:00:00 -bash
 zrg      25317 25305  0 23:51 pts/4    00:00:00 ps -f
: $ bash
: $ ps -f
 UID        PID  PPID  C STIME TTY          TIME CMD
 zrg      25305  4834  0 23:51 pts/4    00:00:00 -bash
 zrg      25347 25305  0 23:53 pts/4    00:00:00 bash
 zrg      25352 25347  0 23:54 pts/4    00:00:00 ps -f
输入命令之后，一个子 shell 就出现了。第二个 ps -f 是在子 shell 中执行的。可以从显示结果中看到两个 bash shell 程序在运行。
: $ bash
: $ bash
: $ bash
: $ ps --forest
   PID TTY          TIME CMD
 25305 pts/4    00:00:00 bash
 25347 pts/4    00:00:00  \_ bash
 25372 pts/4    00:00:00      \_ bash
 25377 pts/4    00:00:00          \_ bash
 25382 pts/4    00:00:00              \_ ps
在上面例子中，bash 命令被输入了三次。实际上创建了三个子 shell。ps --forest 命令展示了这些子 shell 间的嵌套结构。
可以使用 exit 命令退出子 shell
: $ exit
**** 进程列表
: $ pwd;ls;cd /etc;pwd
/home/zrg/zhaorengui.github.io
404.html  archives  categories  _config.yml  _drafts  Gemfile.lock  index.html  _orgs   README.en.md  _sass       _site  tags
about     assets    category    _data        Gemfile  _includes     _layouts    _posts  README.md     search.xml  tag
/etc
在命令之间加入“;，指定要依次执行的一系列命令

: $ (pwd;ls;cd /etc;pwd)
/home/zrg/zhaorengui.github.io
404.html  archives  categories  _config.yml  _drafts  Gemfile.lock  index.html  _orgs   README.en.md  _sass       _site  tags
about     assets    category    _data        Gemfile  _includes     _layouts    _posts  README.md     search.xml  tag
/etc
使用括号包含命令，成为进程列表

查看是否生成了子 shell，使用：
: $ echo $BASH_SUBSHELL
**** 子shell用法
: // 在后台睡眠10s
: $ sleep 10&
: // 查看后台进程
: $ ps -f
: or
: $ jobs -l

: //将进程列表置入后台
: $ (sleep 2;echo $BASH_SUBSHELL;sleep 2)&
: // 创建备份
: $ (tar -cf Rich.rar /home/rich;tar -cf My.tar /home/christine)&

: //协程：在后台生成一个子shell，同时在这个子shell中执行命令。
: // 进行协程处理，使用 coproc 命令
: $ coproc sleep 10
: $ coproc My_Job{sleep 10;}
*** 理解 shell 的内建命令
- 外部命令
: 也被称为文件系统命令，是存在于bash shell之外的程序。
: ps 就是一个外部命令，可以使用 which 和 type 命令找到
: $ which ps
: $ type -a ps
: 当外部命令执行时，会创建一个子进程，这种操作叫做衍生（forking）。

- 内建命令
: 内建命令和外部命令的区别在于前者不需要使用子进程来执行。它们已经和 shell 编译成一体，作为 shell 工具的组成部分存在。
: 可以利用 type 命令来了解某个命令是否是内建的。
: $ type cd
: cd is a shell builtin
: 要注意，有些命令有多种实现。既有内建命令也有外部命令。
: $ type -a echo
: echo is a shell builtin
: echo is /bin/echo
: $ type -a pwd
: pwd is a shell builtin
: pwd is /bin/pwd
