_posts/linux/2018-04-03-linux-cli-and-shell.html
---
layout: post
title: 《Linux 命令行与 Shell 编程大全》阅读笔记
author: zrg
comments: false
description: 命令行界面(command line interface，CLI)，Linux，Shell
categories:
- linux
- shell
tags:
- Shell
photos:
---

<div id="outline-container-orgf650e6a" class="outline-2">
<h2 id="orgf650e6a">前言(Preface)</h2>
<div class="outline-text-2" id="text-orgf650e6a">
<ul class="org-ul">
<li>如何启动命令行以及接下来做什么？</li>
<li>如何使用 shell脚本来自动处理系统管理任务，包括从检测系统统计数据和数据文件到为你的老板生成报表？</li>
</ul>
</div>
</div>
<div id="outline-container-org55b1c98" class="outline-2">
<h2 id="org55b1c98">Linux 命令行</h2>
<div class="outline-text-2" id="text-org55b1c98">
</div>
<div id="outline-container-orgb9f322b" class="outline-3">
<h3 id="orgb9f322b">初探 bash shell 命令</h3>
<div class="outline-text-3" id="text-orgb9f322b">
</div>
<div id="outline-container-orgeddaf89" class="outline-4">
<h4 id="orgeddaf89">学习 shell 开始</h4>
<div class="outline-text-4" id="text-orgeddaf89">
<ol class="org-ol">
<li>启动 shell
<ul class="org-ul">
<li>/bin/bash //重点讨论 GNU bash shell</li>
</ul></li>
<li>shell 提示符
<ul class="org-ul">
<li>默认的 bash shell 提示符是美元符号 \(，看起来是这样的：zrg@debian:~\)</li>
</ul></li>
<li>bash 手册
<ul class="org-ul">
<li>man 命令用来访问存储在 Linux 系统上的手册页面。</li>
</ul></li>
</ol>
<p>
$ man man
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">节</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Name</td>
<td class="org-left">显示命令和一段简短的描述</td>
</tr>

<tr>
<td class="org-left">Synopsis</td>
<td class="org-left">命令的语法</td>
</tr>

<tr>
<td class="org-left">Configuration</td>
<td class="org-left">命令配置信息</td>
</tr>

<tr>
<td class="org-left">Description</td>
<td class="org-left">命令的一般性描述</td>
</tr>

<tr>
<td class="org-left">Options</td>
<td class="org-left">命令选项描述</td>
</tr>

<tr>
<td class="org-left">Exit Status</td>
<td class="org-left">命令的推出状态指示</td>
</tr>

<tr>
<td class="org-left">Return Value</td>
<td class="org-left">命令的返回值</td>
</tr>

<tr>
<td class="org-left">Errors</td>
<td class="org-left">命令的错误信息</td>
</tr>

<tr>
<td class="org-left">Environment</td>
<td class="org-left">描述所使用的环境变量</td>
</tr>

<tr>
<td class="org-left">Files</td>
<td class="org-left">命令用到的文件</td>
</tr>

<tr>
<td class="org-left">Versions</td>
<td class="org-left">命令的版本信息</td>
</tr>

<tr>
<td class="org-left">Conforming To</td>
<td class="org-left">命令所遵从的标准</td>
</tr>

<tr>
<td class="org-left">Notes</td>
<td class="org-left">其他有帮助的资料</td>
</tr>

<tr>
<td class="org-left">Bugs</td>
<td class="org-left">提供提交Bug的途径</td>
</tr>

<tr>
<td class="org-left">Example</td>
<td class="org-left">展示命令的用法</td>
</tr>

<tr>
<td class="org-left">Authors</td>
<td class="org-left">命令开发人员的信息</td>
</tr>

<tr>
<td class="org-left">Copyright</td>
<td class="org-left">命令源代码的版权状况</td>
</tr>

<tr>
<td class="org-left">See Also</td>
<td class="org-left">与该命令类似的其他命令</td>
</tr>
</tbody>
</table>
<pre class="example">
如果不记得命令名怎么办？可以使用关键字搜索手册页。
$ man -k terminal

</pre>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Linux 手册页的内容区域</caption>

<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">区域号</th>
<th scope="col" class="org-left">所涵盖的内容</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">可执行程序或shell命令</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">系统调用</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">库调用</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">特殊文件</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">文件格式与约定</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">游戏</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">概览、约定及杂项</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">超级用户和系统管理员命令</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">内核例程</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8e52176" class="outline-4">
<h4 id="org8e52176">文件、目录操作</h4>
<div class="outline-text-4" id="text-org8e52176">
<ul class="org-ul">
<li>cd</li>
<li>ls</li>
<li>touch</li>
<li>cp</li>
<li>mv</li>
<li>ln</li>
<li>rm</li>
<li>mkdir</li>
<li>rmdir</li>
<li>file</li>
<li>cat</li>
<li>more</li>
<li>less</li>
<li>tail</li>
<li>head</li>
</ul>
</div>
</div>
<div id="outline-container-orgd4317a4" class="outline-4">
<h4 id="orgd4317a4">进程、磁盘统计和管理</h4>
<div class="outline-text-4" id="text-orgd4317a4">
<ul class="org-ul">
<li>ps -ef</li>
<li>top</li>
<li>kill</li>
<li>killall</li>
<li>mount</li>
<li>umount</li>
<li>df -h</li>
<li>du</li>
</ul>
</div>
</div>
<div id="outline-container-org01583a4" class="outline-4">
<h4 id="org01583a4">排序、归档数据</h4>
<div class="outline-text-4" id="text-org01583a4">
<ul class="org-ul">
<li>sort</li>
<li>grep</li>
<li>gzip</li>
<li>gzcat</li>
<li>gunzip</li>
<li>tar</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4a06ebf" class="outline-3">
<h3 id="org4a06ebf">理解 shell</h3>
<div class="outline-text-3" id="text-org4a06ebf">
</div>
<div id="outline-container-org64c48b5" class="outline-4">
<h4 id="org64c48b5">shell 类型</h4>
<div class="outline-text-4" id="text-org64c48b5">
<ul class="org-ul">
<li>/bin/bash</li>
<li>/bin/tcsh</li>
<li>/bin/dash</li>
<li>/bin/csh</li>
<li>/bin/sh</li>
</ul>
</div>
</div>
<div id="outline-container-org6391dc1" class="outline-4">
<h4 id="org6391dc1">Shell 的父子关系</h4>
<div class="outline-text-4" id="text-org6391dc1">
</div>
<ul class="org-ul">
<li><a id="org111970a"></a>理解<br />
<div class="outline-text-5" id="text-org111970a">
<pre class="example">
$ ps -f

</pre>
<p>
UID        PID  PPID  C STIME TTY          TIME CMD
zrg      25305  4834  8 23:51 pts/4    00:00:00 -bash
zrg      25317 25305  0 23:51 pts/4    00:00:00 ps -f
</p>
<pre class="example">
$ bash
$ ps -f

</pre>
<p>
 UID        PID  PPID  C STIME TTY          TIME CMD
 zrg      25305  4834  0 23:51 pts/4    00:00:00 -bash
 zrg      25347 25305  0 23:53 pts/4    00:00:00 bash
 zrg      25352 25347  0 23:54 pts/4    00:00:00 ps -f
输入命令之后，一个子 shell 就出现了。第二个 ps -f 是在子 shell 中执行的。可以从显示结果中看到两个 bash shell 程序在运行。
</p>
<pre class="example">
$ bash
$ bash
$ bash
$ ps --forest

</pre>
<p>
   PID TTY          TIME CMD
 25305 pts/4    00:00:00 bash
 25347 pts/4    00:00:00  &ensp;bash
 25372 pts/4    00:00:00      &ensp;bash
 25377 pts/4    00:00:00          &ensp;bash
 25382 pts/4    00:00:00              &ensp;ps
在上面例子中，bash 命令被输入了三次。实际上创建了三个子 shell。ps &#x2013;forest 命令展示了这些子 shell 间的嵌套结构。
可以使用 exit 命令退出子 shell
</p>
<pre class="example">
$ exit

</pre>
</div>
</li>
<li><a id="org189681d"></a>进程列表<br />
<div class="outline-text-5" id="text-org189681d">
<pre class="example">
$ pwd;ls;cd /etc;pwd

</pre>
<p>
/home/zrg/zhaorengui.github.io
404.html  archives  categories  _config.yml  _drafts  Gemfile.lock  index.html  _orgs   README.en.md  _sass       _site  tags
about     assets    category    _data        Gemfile  _includes     _layouts    _posts  README.md     search.xml  tag
/etc
在命令之间加入“;，指定要依次执行的一系列命令
</p>

<pre class="example">
$ (pwd;ls;cd /etc;pwd)

</pre>
<p>
/home/zrg/zhaorengui.github.io
404.html  archives  categories  _config.yml  _drafts  Gemfile.lock  index.html  _orgs   README.en.md  _sass       _site  tags
about     assets    category    _data        Gemfile  _includes     _layouts    _posts  README.md     search.xml  tag
/etc
使用括号包含命令，成为进程列表
</p>

<p>
查看是否生成了子 shell，使用：
</p>
<pre class="example">
$ echo $BASH_SUBSHELL

</pre>
</div>
</li>
<li><a id="org3e152cd"></a>子shell用法<br />
<div class="outline-text-5" id="text-org3e152cd">
<pre class="example">
// 在后台睡眠10s
$ sleep 10&amp;
// 查看后台进程
$ ps -f
or
$ jobs -l

</pre>

<pre class="example">
//将进程列表置入后台
$ (sleep 2;echo $BASH_SUBSHELL;sleep 2)&amp;
// 创建备份
$ (tar -cf Rich.rar /home/rich;tar -cf My.tar /home/christine)&amp;

</pre>

<pre class="example">
//协程：在后台生成一个子shell，同时在这个子shell中执行命令。
// 进行协程处理，使用 coproc 命令
$ coproc sleep 10
$ coproc My_Job{sleep 10;}

</pre>
</div>
</li>
</ul>
</div>
<div id="outline-container-orge3e6752" class="outline-4">
<h4 id="orge3e6752">理解 shell 的内建命令</h4>
<div class="outline-text-4" id="text-orge3e6752">
<ul class="org-ul">
<li>外部命令</li>
</ul>
<pre class="example">
也被称为文件系统命令，是存在于bash shell之外的程序。
ps 就是一个外部命令，可以使用 which 和 type 命令找到
$ which ps
$ type -a ps
当外部命令执行时，会创建一个子进程，这种操作叫做衍生（forking）。

</pre>

<ul class="org-ul">
<li>内建命令</li>
</ul>
<pre class="example">
内建命令和外部命令的区别在于前者不需要使用子进程来执行。它们已经和 shell 编译成一体，作为 shell 工具的组成部分存在。
可以利用 type 命令来了解某个命令是否是内建的。
$ type cd
cd is a shell builtin
要注意，有些命令有多种实现。既有内建命令也有外部命令。
$ type -a echo
echo is a shell builtin
echo is /bin/echo
$ type -a pwd
pwd is a shell builtin
pwd is /bin/pwd

</pre>
</div>
</div>
</div>
