_orgs/_posts/linux/2018-04-03-linux-cli-and-shell.org
*** 创建一个简单的脚本
#+NAME: 一个简单的脚本
#+BEGIN_SRC shell
#!/bin/bash  #告诉shell用/bin/bash来运行脚本。
# This script displays the date and who's #脚本用途说明及作者等信息描述 
echo "This's is a shell script." #显示消息
echo -n "The time and date are: " #n表示在一行显示
date

echo "User info for userid: $USER" #环境变量，用set命令可以查看一份完整的当前环境变量列表。
echo UID: $UID
echo HOME: $HOME
echo "The cost of the item is \$15." #美元需要使用\转义

days = 10 #用户自定义变量
echo $days

# 有两种方法可以将命令赋给变量
test = `date` #用一对反引号把整个命令围起来
test = $(date) #使用$()格式
today = $(date+%y%m%d) #today变量被赋予格式化后的date命令的输出。
#+END_SRC
*** 重定向输入和输出
: // 输出重定向
: $ date > test
: $ date >> test

: // 输入重定向
: $ wc < test
 2 11 60
: //wc命令，默认情况下，会输出3个值：
- 文本的行数
- 文本的词数
- 文本的字节数

: 内联输入重定向（inline input redirection）
: $ wc << EOF
: shell 会用PS2环境变量中定义的次提示符来提示输入数据
*** 管道
: $ rpm -qa | sort
: //上面的命令会同时运行。
*** 执行数学运算
: $ var1=$(1+5)
: $ var2=$[$var1 * 2]
: // 使用$和[]将数学表达式围起来
: 注意：bash shell数学运算符支持整数运算。z shell（zsh）提供了完整的浮点数算术操作。

: 浮点解决方案
: 1.用内建的bash计算器：bc
: $ bc
3.44 / 5
0
scale = 4 浮点运算由scale控制，默认值为0
: // -q选项可以不显示冗长的欢迎信息
: $ bc -q 
var1 = 10
var1 * 4
40
var2 = var1 / 5
print var2
2
quit
: $

: 2. 在脚本中使用bc
#+NAME: 简单示例
#+BEGIN_SRC shell
#!/bin/bash
var1 = $(echo "scale=4;3.44 / 5" | bc)
echo The answer is $var1
#+END_SRC 

#+NAME:使用内联重定向，允许直接在命令行中重定向数据
#+BEGIN_SRC shell
#!/bin/bash

var1 = 10.46
var2 = 43.67
var3 = 33.2
var4 = 71

var5 = $(bc << EOF
scale =4
a1 = ($var1*$var2)
a2 = ($var3*var4)
a1+b1
EOF
)

echo "The final answer for this mess is $var5"
#+END_SRC
*** 退出脚本
: 1. 退出状态码（exit status）
: $ echo $?
0
#+NAME: 退出状态码
| 状态码 | 描述                       |
|--------+----------------------------|
|      0 | 命令成功结束               |
|      1 | 一般性未知错误             |
|      2 | 不适合的shell命令          |
|    126 | 命令不可执行               |
|    127 | 没找到命令                 |
|    128 | 无效的退出参数             |
|  128+x | 与Linux信号x相关的严重错误 |
|    130 | 通过Ctrl+C终止的命令       |
|    255 | 正常范围之外的退出状态码   |
: 2. exit命令
: exit命令允许在脚本结束时指定一个退出状态码
#+NAME: test文件
#+BEGIN_SRC shell
echo 'Hello, World'
exit 5 
#+END_SRC
: $ ./test 
Hello, World
: $ echo $?
5
** 结构化命令
*** if-then
#+NAME: if-then
#+BEGIN_SRC shell
示例：
#!/bin/bash
testuser = NoSuchUser
#
if grep $testuser /etc/passwd
then
	echo "The bash files for user $testuser are:"
    ls -a /home/$testuser/.b*
    echo
elif ls -d /home/$testuser
then
	echo "The user $testuser has a directory"
else
	echo "The user $testuser does not exist on this system."
    echo
fi

test命令提供了在if-then语句中测试不同条件的途径。
test命令可以判断三类条件：数值比较；字符串比较；文件比较
#+END_SRC
