_posts/linux/2018-04-03-linux-cli-and-shell.html
<div id="outline-container-org78c0766" class="outline-3">
<h3 id="org78c0766">使用编辑器</h3>
<div class="outline-text-3" id="text-org78c0766">
<ol class="org-ol">
<li>Vim</li>
<li>nano</li>
<li>Emacs</li>
<li>gedit</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org8323a15" class="outline-2">
<h2 id="org8323a15">shell 脚本编程基础</h2>
<div class="outline-text-2" id="text-org8323a15">
</div>
<div id="outline-container-org38fbda8" class="outline-3">
<h3 id="org38fbda8">构建基本脚本</h3>
<div class="outline-text-3" id="text-org38fbda8">
</div>
<div id="outline-container-org341a71f" class="outline-4">
<h4 id="org341a71f">创建一个简单的脚本</h4>
<div class="outline-text-4" id="text-org341a71f">
<div class="org-src-container">
<pre class="src src-shell" id="org50bbb09"><span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/bash  #&#21578;&#35785;shell&#29992;/bin/</span><span style="color: #a020f0;">bash&#26469;&#36816;&#34892;&#33050;&#26412;&#12290;</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">This script displays the date and who's #&#33050;&#26412;&#29992;&#36884;&#35828;&#26126;&#21450;&#20316;&#32773;&#31561;&#20449;&#24687;&#25551;&#36848; </span>
<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"This's is a shell script."</span> <span style="color: #b22222;">#</span><span style="color: #b22222;">&#26174;&#31034;&#28040;&#24687;</span>
<span style="color: #483d8b;">echo</span> -n <span style="color: #8b2252;">"The time and date are: "</span> <span style="color: #b22222;">#</span><span style="color: #b22222;">n&#34920;&#31034;&#22312;&#19968;&#34892;&#26174;&#31034;</span>
date

<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"User info for userid: $USER"</span> <span style="color: #b22222;">#</span><span style="color: #b22222;">&#29615;&#22659;&#21464;&#37327;&#65292;&#29992;set&#21629;&#20196;&#21487;&#20197;&#26597;&#30475;&#19968;&#20221;&#23436;&#25972;&#30340;&#24403;&#21069;&#29615;&#22659;&#21464;&#37327;&#21015;&#34920;&#12290;</span>
<span style="color: #483d8b;">echo</span> UID: $<span style="color: #a0522d;">UID</span>
<span style="color: #483d8b;">echo</span> HOME: $<span style="color: #a0522d;">HOME</span>
<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"The cost of the item is \$15."</span> <span style="color: #b22222;">#</span><span style="color: #b22222;">&#32654;&#20803;&#38656;&#35201;&#20351;&#29992;\&#36716;&#20041;</span>

days = 10 <span style="color: #b22222;">#</span><span style="color: #b22222;">&#29992;&#25143;&#33258;&#23450;&#20041;&#21464;&#37327;</span>
<span style="color: #483d8b;">echo</span> $<span style="color: #a0522d;">days</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">&#26377;&#20004;&#31181;&#26041;&#27861;&#21487;&#20197;&#23558;&#21629;&#20196;&#36171;&#32473;&#21464;&#37327;</span>
<span style="color: #483d8b;">test</span> = <span style="color: #ff00ff;">`date`</span> <span style="color: #b22222;">#</span><span style="color: #b22222;">&#29992;&#19968;&#23545;&#21453;&#24341;&#21495;&#25226;&#25972;&#20010;&#21629;&#20196;&#22260;&#36215;&#26469;</span>
<span style="color: #483d8b;">test</span> = $(<span style="color: #ff00ff;">date</span>) <span style="color: #b22222;">#</span><span style="color: #b22222;">&#20351;&#29992;$()&#26684;&#24335;</span>
today = $(<span style="color: #ff00ff;">date</span>+%y%m%d) <span style="color: #b22222;">#</span><span style="color: #b22222;">today&#21464;&#37327;&#34987;&#36171;&#20104;&#26684;&#24335;&#21270;&#21518;&#30340;date&#21629;&#20196;&#30340;&#36755;&#20986;&#12290;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org94610d3" class="outline-4">
<h4 id="org94610d3">重定向输入和输出</h4>
<div class="outline-text-4" id="text-org94610d3">
<pre class="example">
// 输出重定向
$ date &gt; test
$ date &gt;&gt; test

</pre>

<pre class="example">
// 输入重定向
$ wc &lt; test

</pre>
<p>
2 11 60
</p>
<pre class="example">
//wc命令，默认情况下，会输出3个值：

</pre>
<ul class="org-ul">
<li>文本的行数</li>
<li>文本的词数</li>
<li>文本的字节数</li>
</ul>

<pre class="example">
内联输入重定向（inline input redirection）
$ wc &lt;&lt; EOF
shell 会用PS2环境变量中定义的次提示符来提示输入数据

</pre>
</div>
</div>
<div id="outline-container-orgd0eea3b" class="outline-4">
<h4 id="orgd0eea3b">管道</h4>
<div class="outline-text-4" id="text-orgd0eea3b">
<pre class="example">
$ rpm -qa | sort
//上面的命令会同时运行。

</pre>
</div>
</div>
<div id="outline-container-orgc9eba63" class="outline-4">
<h4 id="orgc9eba63">执行数学运算</h4>
<div class="outline-text-4" id="text-orgc9eba63">
<pre class="example">
$ var1=$(1+5)
$ var2=$[$var1 * 2]
// 使用$和[]将数学表达式围起来
注意：bash shell数学运算符支持整数运算。z shell（zsh）提供了完整的浮点数算术操作。

</pre>

<pre class="example">
浮点解决方案
1.用内建的bash计算器：bc
$ bc

</pre>
<p>
3.44 / 5
0
scale = 4 浮点运算由scale控制，默认值为0
</p>
<pre class="example">
// -q选项可以不显示冗长的欢迎信息
$ bc -q 

</pre>
<p>
var1 = 10
var1 * 4
40
var2 = var1 / 5
print var2
2
quit
</p>
<pre class="example">
$

</pre>

<pre class="example">
2. 在脚本中使用bc

</pre>
<div class="org-src-container">
<pre class="src src-shell" id="org2920d0d"><span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/</span><span style="color: #a020f0;">bash</span>
var1 = $(<span style="color: #ff00ff;">echo</span> <span style="color: #8b2252;">"scale=4;3.44 / 5"</span> | bc)
<span style="color: #483d8b;">echo</span> The answer is $<span style="color: #a0522d;">var1</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell" id="org374fa07"><span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/</span><span style="color: #a020f0;">bash</span>

var1 = 10.46
var2 = 43.67
var3 = 33.2
var4 = 71

var5 = $(<span style="color: #ff00ff;">bc</span> &lt;&lt; EOF
<span style="color: #ffa54f;">scale =4</span>
<span style="color: #ffa54f;">a1 = ($var1*$var2)</span>
<span style="color: #ffa54f;">a2 = ($var3*var4)</span>
<span style="color: #ffa54f;">a1+b1</span>
<span style="color: #ffa54f;">EOF</span>
)

<span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"The final answer for this mess is $var5"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4566d90" class="outline-4">
<h4 id="org4566d90">退出脚本</h4>
<div class="outline-text-4" id="text-org4566d90">
<pre class="example">
1. 退出状态码（exit status）
$ echo $?

</pre>
<p>
0
</p>
<table id="org87874bb" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">状态码</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">命令成功结束</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">一般性未知错误</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">不适合的shell命令</td>
</tr>

<tr>
<td class="org-right">126</td>
<td class="org-left">命令不可执行</td>
</tr>

<tr>
<td class="org-right">127</td>
<td class="org-left">没找到命令</td>
</tr>

<tr>
<td class="org-right">128</td>
<td class="org-left">无效的退出参数</td>
</tr>

<tr>
<td class="org-right">128+x</td>
<td class="org-left">与Linux信号x相关的严重错误</td>
</tr>

<tr>
<td class="org-right">130</td>
<td class="org-left">通过Ctrl+C终止的命令</td>
</tr>

<tr>
<td class="org-right">255</td>
<td class="org-left">正常范围之外的退出状态码</td>
</tr>
</tbody>
</table>
<pre class="example">
2. exit命令
exit命令允许在脚本结束时指定一个退出状态码

</pre>
<div class="org-src-container">
<pre class="src src-shell" id="orga9b3fab"><span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">'Hello, World'</span>
<span style="color: #a020f0;">exit</span> 5 
</pre>
</div>
<pre class="example">
$ ./test 

</pre>
<p>
Hello, World
</p>
<pre class="example">
$ echo $?

</pre>
<p>
5
</p>
</div>
</div>
</div>
<div id="outline-container-org3a888ad" class="outline-3">
<h3 id="org3a888ad">结构化命令</h3>
<div class="outline-text-3" id="text-org3a888ad">
</div>
<div id="outline-container-orgf66dff0" class="outline-4">
<h4 id="orgf66dff0">if-then</h4>
<div class="outline-text-4" id="text-orgf66dff0">
<div class="org-src-container">
<pre class="src src-shell" id="org11fe92b">&#31034;&#20363;&#65306;
<span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/bash</span>
testuser = NoSuchUser
<span style="color: #b22222;">#</span>
<span style="color: #a020f0;">if</span> grep $<span style="color: #a0522d;">testuser</span> /etc/passwd
<span style="color: #a020f0;">then</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"The bash files for user $testuser are:"</span>
    ls -a /home/$<span style="color: #a0522d;">testuser</span>/.b*
    <span style="color: #483d8b;">echo</span>
<span style="color: #a020f0;">elif</span> ls -d /home/$<span style="color: #a0522d;">testuser</span>
<span style="color: #a020f0;">then</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"The user $testuser has a directory"</span>
<span style="color: #a020f0;">else</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"The user $testuser does not exist on this system."</span>
    <span style="color: #483d8b;">echo</span>
<span style="color: #a020f0;">fi</span>

<span style="color: #483d8b;">test</span>&#21629;&#20196;&#25552;&#20379;&#20102;&#22312;if-then&#35821;&#21477;&#20013;&#27979;&#35797;&#19981;&#21516;&#26465;&#20214;&#30340;&#36884;&#24452;&#12290;
<span style="color: #483d8b;">test</span>&#21629;&#20196;&#21487;&#20197;&#21028;&#26029;&#19977;&#31867;&#26465;&#20214;&#65306;&#25968;&#20540;&#27604;&#36739;&#65307;&#23383;&#31526;&#20018;&#27604;&#36739;&#65307;&#25991;&#20214;&#27604;&#36739;
</pre>
</div>
</div>
<ul class="org-ul">
