_orgs/_posts/linux/2018-04-03-linux-cli-and-shell.org
**** test 命令
 : 格式：
 if test condition
 then
	 commands
 fi
 : 如果 test 命令中列出的条件成立，退出并返回退出状态码0；如果条件不成立，退出并返回非零的退出状态码。
 #+NAME: if-then 字符串比较
 #+BEGIN_SRC shell
 #!/bin/bash
 $var = 10
 if [$var -eq 5]
 then 
	 echo "The value $var are equal."
 else
	 echo "The value $var are different."
 fi
 $var1 = baduser
 if [$USER != $var1]
 then
	 echo "This is not $var1"
 else
	 echo "Welcome $var"
 fi
 $var2 = baseall
 $var3 = hockey
 if [$var2 \> $var3] #>符号需要转义，防止解释成输出重定向
 then
	 echo "$var2 is greater than $var3"
 else
	 echo "$var2 is less than $var3"
 fi
 #+END_SRC
 : 特别说明：
 : 1.test命令和测试表达式使用标准的数学比较符号来表示字符串比较，而用文本代码来表示数值比较。
 : 2.比较测试时，大写字母被认为是小于小写字母，但sort命令恰好相反。

 #+NAME: if-then 字符串大小
 #+BEGIN_SRC shell
 #!/bin/bash
 var1 = testing
 var2 =''
 if [-n $var1]
 then
	 echo "The string '$var1' is not empty."
 else
	 echo "The string '$var1' is empty."
 fi
 if [-z $var2]
 then
	 echo "The string '$var2' is empty."
 else
	 echo "The string '$var2' is not empty."
 fi
 #+END_SRC

 #+NAME: if-then 文件比较
 #+BEGIN_SRC shell
 #!/bin/bash
 jump_directory=/home/arthur
 if [-d $jump_directory]
 then
	 echo "The $jump_directory directory exists."
 else
	 echo "The $jump_directory directory does not exists."
 fi
 #+END_SRC
 | 比较            | 描述                                     |
 |-----------------+------------------------------------------|
 | -d file         | 检查file是否存在并是一个目录             |
 | -e file         | 检查file是否存在                         |
 | -f file         | 检查file是否存在并是一个文件             |
 | -r file         | 检查file是否存在并可读                   |
 | -s file         | 检查file是否存在并非空                   |
 | -w file         | 检查file是否存在并可写                   |
 | -x file         | 检查file是否存在并可执行                 |
 | -O file         | 检查file是否存在并属当前用户所有         |
 | -G file         | 检查file是否存在并且默认组与当前用户相同 |
 | file1 -nt file2 | 检查file是否比file2                      |
 | file1 -ot file2 | 检查file是否比file2旧                    |
**** 复合条件
 : 格式：
 [condition1] && [condition2]
 [condition1] || [condition2]
 #+NAME: if-then 复合条件测试
 #+BEGIN_SRC shell
   #!/bin/bash
   # testing compound comparisons
   #
   if [-d $HOME] && [-w $HOME/testing]
   then
	   echo "The file exists and you can write to it."
   else
	   echo "I cannot write to the file."
   fi
 #+END_SRC
**** if-then 的高级特性
 #+NAME: if-then 双括号
 #+BEGIN_SRC shell
   #!/bin/bash
   # (( expression )) expression 可以是任意的数学赋值或比较表达式。
   var1=10
   if(( $var1 ** 2 > 90))
   then
	   (( $var2 = $var1 ** 2))
	   echo "The square of $var1 is $var2."
   fi
 #+END_SRC

 #+NAME: if-then 双方括号
 #+BEGIN_SRC shell
   #!/bin/bash
   # [[ expression ]]
   if[[ $USER == r* ]]
   then
	   echo "Hello $USER"
 else
	 echo "Sorry, I do not know you."
   fi
 #+END_SRC
*** case 命令
: 格式：
case $变量名 in
模式1)
	命令序列1;;
模式2)
	命令序列2;;
*)
	默认执行的命令序列;;
esac 
#+NAME: case
#+BEGIN_SRC shell
  #!/bin/bash
  case $action in
	start | begin)
		echo "start something"
		echo "begin something";;
	stop | end)
		echo "stop something"
		echo "end something";;
	*)
	echo "Ignorant.";;
esac
#+END_SRC
