_posts/linux/2018-04-03-linux-cli-and-shell.html
<li><a id="org659ebb4"></a>test 命令<br />
<div class="outline-text-5" id="text-org659ebb4">
<pre class="example">
格式：

</pre>
<p>
if test condition
then
	commands
fi
</p>
<pre class="example">
如果 test 命令中列出的条件成立，退出并返回退出状态码0；如果条件不成立，退出并返回非零的退出状态码。

</pre>
<div class="org-src-container">
<pre class="src src-shell" id="org91b1c50"><span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/</span><span style="color: #a020f0;">bash</span>
$<span style="color: #a0522d;">var</span> = 10
<span style="color: #a020f0;">if</span> [$<span style="color: #a0522d;">var</span> -eq 5]
<span style="color: #a020f0;">then</span> 
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"The value $var are equal."</span>
<span style="color: #a020f0;">else</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"The value $var are different."</span>
<span style="color: #a020f0;">fi</span>
$<span style="color: #a0522d;">var1</span> = baduser
<span style="color: #a020f0;">if</span> [$<span style="color: #a0522d;">USER</span> != $<span style="color: #a0522d;">var1</span>]
<span style="color: #a020f0;">then</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"This is not $var1"</span>
<span style="color: #a020f0;">else</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"Welcome $var"</span>
<span style="color: #a020f0;">fi</span>
$<span style="color: #a0522d;">var2</span> = baseall
$<span style="color: #a0522d;">var3</span> = hockey
<span style="color: #a020f0;">if</span> [$<span style="color: #a0522d;">var2</span> <span style="color: #8b2252;">\&gt;</span> $<span style="color: #a0522d;">var3</span>] <span style="color: #b22222;">#</span><span style="color: #b22222;">&gt;&#31526;&#21495;&#38656;&#35201;&#36716;&#20041;&#65292;&#38450;&#27490;&#35299;&#37322;&#25104;&#36755;&#20986;&#37325;&#23450;&#21521;</span>
<span style="color: #a020f0;">then</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"$var2 is greater than $var3"</span>
<span style="color: #a020f0;">else</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"$var2 is less than $var3"</span>
<span style="color: #a020f0;">fi</span>
</pre>
</div>
<pre class="example">
特别说明：
1.test命令和测试表达式使用标准的数学比较符号来表示字符串比较，而用文本代码来表示数值比较。
2.比较测试时，大写字母被认为是小于小写字母，但sort命令恰好相反。

</pre>

<div class="org-src-container">
<pre class="src src-shell" id="org181dc33"><span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/</span><span style="color: #a020f0;">bash</span>
var1 = testing
var2 =<span style="color: #8b2252;">''</span>
<span style="color: #a020f0;">if</span> [-n $<span style="color: #a0522d;">var1</span>]
<span style="color: #a020f0;">then</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"The string '$var1' is not empty."</span>
<span style="color: #a020f0;">else</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"The string '$var1' is empty."</span>
<span style="color: #a020f0;">fi</span>
<span style="color: #a020f0;">if</span> [-z $<span style="color: #a0522d;">var2</span>]
<span style="color: #a020f0;">then</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"The string '$var2' is empty."</span>
<span style="color: #a020f0;">else</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"The string '$var2' is not empty."</span>
<span style="color: #a020f0;">fi</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell" id="orge5c65a9"><span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/</span><span style="color: #a020f0;">bash</span>
<span style="color: #a0522d;">jump_directory</span>=/home/arthur
<span style="color: #a020f0;">if</span> [-d $<span style="color: #a0522d;">jump_directory</span>]
<span style="color: #a020f0;">then</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"The $jump_directory directory exists."</span>
<span style="color: #a020f0;">else</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"The $jump_directory directory does not exists."</span>
<span style="color: #a020f0;">fi</span>
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">比较</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">-d file</td>
<td class="org-left">检查file是否存在并是一个目录</td>
</tr>

<tr>
<td class="org-left">-e file</td>
<td class="org-left">检查file是否存在</td>
</tr>

<tr>
<td class="org-left">-f file</td>
<td class="org-left">检查file是否存在并是一个文件</td>
</tr>

<tr>
<td class="org-left">-r file</td>
<td class="org-left">检查file是否存在并可读</td>
</tr>

<tr>
<td class="org-left">-s file</td>
<td class="org-left">检查file是否存在并非空</td>
</tr>

<tr>
<td class="org-left">-w file</td>
<td class="org-left">检查file是否存在并可写</td>
</tr>

<tr>
<td class="org-left">-x file</td>
<td class="org-left">检查file是否存在并可执行</td>
</tr>

<tr>
<td class="org-left">-O file</td>
<td class="org-left">检查file是否存在并属当前用户所有</td>
</tr>

<tr>
<td class="org-left">-G file</td>
<td class="org-left">检查file是否存在并且默认组与当前用户相同</td>
</tr>

<tr>
<td class="org-left">file1 -nt file2</td>
<td class="org-left">检查file是否比file2</td>
</tr>

<tr>
<td class="org-left">file1 -ot file2</td>
<td class="org-left">检查file是否比file2旧</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="orgaac7ac3"></a>复合条件<br />
<div class="outline-text-5" id="text-orgaac7ac3">
<pre class="example">
格式：

</pre>
<p>
[condition1] &amp;&amp; [condition2]
[condition1] || [condition2]
</p>
<div class="org-src-container">
<pre class="src src-shell" id="org6ae87e8"><span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/</span><span style="color: #a020f0;">bash</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">testing compound comparisons</span>
<span style="color: #b22222;">#</span>
<span style="color: #a020f0;">if</span> [-d $<span style="color: #a0522d;">HOME</span>] &amp;&amp; [-w $<span style="color: #a0522d;">HOME</span>/testing]
<span style="color: #a020f0;">then</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"The file exists and you can write to it."</span>
<span style="color: #a020f0;">else</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"I cannot write to the file."</span>
<span style="color: #a020f0;">fi</span>
</pre>
</div>
</div>
</li>
<li><a id="org206f326"></a>if-then 的高级特性<br />
<div class="outline-text-5" id="text-org206f326">
<div class="org-src-container">
<pre class="src src-shell" id="orgff5bd09"><span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/</span><span style="color: #a020f0;">bash</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">(( expression )) expression &#21487;&#20197;&#26159;&#20219;&#24847;&#30340;&#25968;&#23398;&#36171;&#20540;&#25110;&#27604;&#36739;&#34920;&#36798;&#24335;&#12290;</span>
<span style="color: #a0522d;">var1</span>=10
<span style="color: #a020f0;">if</span>(( $<span style="color: #a0522d;">var1</span> ** 2 &gt; 90))
<span style="color: #a020f0;">then</span>
        (( $<span style="color: #a0522d;">var2</span> = $<span style="color: #a0522d;">var1</span> ** 2))
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"The square of $var1 is $var2."</span>
<span style="color: #a020f0;">fi</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell" id="org4a3998a">  <span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/bash</span>
  <span style="color: #b22222;"># </span><span style="color: #b22222;">[[ expression ]]</span>
  <span style="color: #a020f0;">if</span>[[ $<span style="color: #a0522d;">USER</span> == r* ]]
  <span style="color: #a020f0;">then</span>
          <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"Hello $USER"</span>
<span style="color: #a020f0;">else</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"Sorry, I do not know you."</span>
  <span style="color: #a020f0;">fi</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgfa6912e" class="outline-4">
<h4 id="orgfa6912e">case 命令</h4>
<div class="outline-text-4" id="text-orgfa6912e">
<pre class="example">
格式：

</pre>
<p>
case $变量名 in
模式1)
	命令序列1;;
模式2)
	命令序列2;;
*)
	默认执行的命令序列;;
esac 
</p>
<div class="org-src-container">
<pre class="src src-shell" id="org69ca8fe">  <span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/bash</span>
  <span style="color: #a020f0;">case</span> $<span style="color: #a0522d;">action</span><span style="color: #a020f0;"> in</span>
        start | begin)
                <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"start something"</span>
                <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"begin something"</span>;;
        stop | end)
                <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"stop something"</span>
                <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"end something"</span>;;
        *)
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"Ignorant."</span>;;
<span style="color: #a020f0;">esac</span>
</pre>
</div>
</div>
</div>
