_orgs/_posts/linux/2018-04-03-linux-cli-and-shell.org
*** for 命令
: 格式：
for var in list
do
	commands
done
#+NAME: 遍历
#+BEGIN_SRC shell
#!/bin/bash
#
# basic for command
for country in China America India Japen
do
	echo "The next state is $country"
done

# another example of how not to use the for command
# 1.使用转义字符（反斜线）
# 2.使用双引号
for test in I don\'t know if "this'll" work
do
	echo "word:$test"
done

# using a variable to hold the list
list="China America India Japen"
list=$list" Connecticut"
for country in $list
do
	echo "Welcome to $country"
done

# reading values from a file
file="states"
# 修改IFS环境变量的值，使其只能识别换行符
IFS=$'\n'
for state in $(cat $file)
do
	echo "Visit beautiful $state"
done

# iterate through all the files in a directory
for file in $HOME/* /etc/nginx/*
do
	if [-d "$file"]
	then
		echo "$file is a directory."
	elif [-f "$file"]
	then
		echo "$file is a file."
	fi
done

# C-style for loop
#
for (( i=1; i <= 10; i++))
do
	echo "The next number is $i"
done
# multiple variable
for (( a=1; b=10;a <= 10; a++, b++))
do
	echo "$a - $b"
done
#+END_SRC
*** while 命令
: 格式：
while test command
do
	other commands
done
#+NAME: while
#+BEGIN_SRC shell
# while command test
var1=10
while [ $var1 -gt 0 ]
do
	echo $var1
	var1=$[ $var1 - 1 ]
done
#+END_SRC
*** until 命令
: until 命令和 while 命令完全相反。
: 格式：
until test command
do
	other commands
done
#+NAME:until
#+BEGIN_SRC shell -n 1
#!/bin/bash
# using the until command
var1=100
until [ $var1 -eq 0 ]
do
	echo $var1
	var1=$[ $var1 -25 ]
done
#+END_SRC
*** 应用
**** 循环处理文件数据
#+NAME:循环处理文件数据-处理 /etc/passwd 文件中的数据(1.使用嵌套循环；2.修改IFS环境变量)
#+BEGIN_SRC shell -n 1
#!/bin/bash
# changing the IFS value
IFS.OLD=$IFS
IFS=$'\n'
for entry in $(cat /etc/passwd)
do
	echo "Values in $entry -"
	IFS=:
	for value in $entry
	do
		echo "$value"
	done
done
# 该脚本使用了两个不同的 IFS 的值来解析数据，第一个 IFS 值解析出 /etc/passwd 文件中的单独的行，内部 for 循环接着将 IFS 的值修改为冒号，允许你从 /etc/passwd 的行中解析出单独的值。
#+END_SRC
