_posts/linux/2018-04-03-linux-cli-and-shell.html
<div id="outline-container-org41285f0" class="outline-4">
<h4 id="org41285f0">for 命令</h4>
<div class="outline-text-4" id="text-org41285f0">
<pre class="example">
格式：

</pre>
<p>
for var in list
do
	commands
done
</p>
<div class="org-src-container">
<pre class="src src-shell" id="org3d0d470"><span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/</span><span style="color: #a020f0;">bash</span>
<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">basic for command</span>
<span style="color: #a020f0;">for</span> country<span style="color: #a020f0;"> in</span> China America India Japen
<span style="color: #a020f0;">do</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"The next state is $country"</span>
<span style="color: #a020f0;">done</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">another example of how not to use the for command</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">1.&#20351;&#29992;&#36716;&#20041;&#23383;&#31526;&#65288;&#21453;&#26012;&#32447;&#65289;</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">2.&#20351;&#29992;&#21452;&#24341;&#21495;</span>
<span style="color: #a020f0;">for </span><span style="color: #483d8b;">test</span><span style="color: #a020f0;"> in</span> I don<span style="color: #8b2252;">\'</span>t know if <span style="color: #8b2252;">"this'll"</span> work
<span style="color: #a020f0;">do</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"word:$test"</span>
<span style="color: #a020f0;">done</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">using a variable to hold the list</span>
<span style="color: #a0522d;">list</span>=<span style="color: #8b2252;">"China America India Japen"</span>
<span style="color: #a0522d;">list</span>=$<span style="color: #a0522d;">list</span><span style="color: #8b2252;">" Connecticut"</span>
<span style="color: #a020f0;">for</span> country<span style="color: #a020f0;"> in</span> $<span style="color: #a0522d;">list</span>
<span style="color: #a020f0;">do</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"Welcome to $country"</span>
<span style="color: #a020f0;">done</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">reading values from a file</span>
<span style="color: #a0522d;">file</span>=<span style="color: #8b2252;">"states"</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">&#20462;&#25913;IFS&#29615;&#22659;&#21464;&#37327;&#30340;&#20540;&#65292;&#20351;&#20854;&#21482;&#33021;&#35782;&#21035;&#25442;&#34892;&#31526;</span>
<span style="color: #a0522d;">IFS</span>=$<span style="color: #8b2252;">'\n'</span>
<span style="color: #a020f0;">for</span> state<span style="color: #a020f0;"> in</span> $(<span style="color: #ff00ff;">cat</span> $<span style="color: #a0522d;">file</span>)
<span style="color: #a020f0;">do</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"Visit beautiful $state"</span>
<span style="color: #a020f0;">done</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">iterate through all the files in a directory</span>
<span style="color: #a020f0;">for</span> file<span style="color: #a020f0;"> in</span> $<span style="color: #a0522d;">HOME</span>/* /etc/nginx/*
<span style="color: #a020f0;">do</span>
        <span style="color: #a020f0;">if</span> [-d <span style="color: #8b2252;">"$file"</span>]
        <span style="color: #a020f0;">then</span>
                <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"$file is a directory."</span>
        <span style="color: #a020f0;">elif</span> [-f <span style="color: #8b2252;">"$file"</span>]
        <span style="color: #a020f0;">then</span>
                <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"$file is a file."</span>
        <span style="color: #a020f0;">fi</span>
<span style="color: #a020f0;">done</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">C-style for loop</span>
<span style="color: #b22222;">#</span>
<span style="color: #a020f0;">for</span> (( <span style="color: #a0522d;">i</span>=1; i &lt;= 10; i++))
<span style="color: #a020f0;">do</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"The next number is $i"</span>
<span style="color: #a020f0;">done</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">multiple variable</span>
<span style="color: #a020f0;">for</span> (( <span style="color: #a0522d;">a</span>=1; <span style="color: #a0522d;">b</span>=10;a &lt;= 10; a++, b++))
<span style="color: #a020f0;">do</span>
        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"$a - $b"</span>
<span style="color: #a020f0;">done</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga544c56" class="outline-4">
<h4 id="orga544c56">while 命令</h4>
<div class="outline-text-4" id="text-orga544c56">
<pre class="example">
格式：

</pre>
<p>
while test command
do
	other commands
done
</p>
<div class="org-src-container">
<pre class="src src-shell" id="orgf3f675e"><span style="color: #b22222;"># </span><span style="color: #b22222;">while command test</span>
<span style="color: #a0522d;">var1</span>=10
<span style="color: #a020f0;">while</span> [ $<span style="color: #a0522d;">var1</span> -gt 0 ]
<span style="color: #a020f0;">do</span>
        <span style="color: #483d8b;">echo</span> $<span style="color: #a0522d;">var1</span>
        <span style="color: #a0522d;">var1</span>=$[ $<span style="color: #a0522d;">var1</span> - 1 ]
<span style="color: #a020f0;">done</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5a6bfb8" class="outline-4">
<h4 id="org5a6bfb8">until 命令</h4>
<div class="outline-text-4" id="text-org5a6bfb8">
<pre class="example">
until 命令和 while 命令完全相反。
格式：

</pre>
<p>
until test command
do
	other commands
done
</p>
<div class="org-src-container">
<pre class="src src-shell" id="org0871e20"><span class="linenr">1: </span><span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/</span><span style="color: #a020f0;">bash</span>
<span class="linenr">2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">using the until command</span>
<span class="linenr">3: </span><span style="color: #a0522d;">var1</span>=100
<span class="linenr">4: </span><span style="color: #a020f0;">until</span> [ $<span style="color: #a0522d;">var1</span> -eq 0 ]
<span class="linenr">5: </span><span style="color: #a020f0;">do</span>
<span class="linenr">6: </span>        <span style="color: #483d8b;">echo</span> $<span style="color: #a0522d;">var1</span>
<span class="linenr">7: </span>        <span style="color: #a0522d;">var1</span>=$[ $<span style="color: #a0522d;">var1</span> -25 ]
<span class="linenr">8: </span><span style="color: #a020f0;">done</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org41f3aba" class="outline-4">
<h4 id="org41f3aba">应用</h4>
<div class="outline-text-4" id="text-org41f3aba">
</div>
<ul class="org-ul">
<li><a id="org79f1ff8"></a>循环处理文件数据<br />
<div class="outline-text-5" id="text-org79f1ff8">
<div class="org-src-container">
<pre class="src src-shell" id="orgb855063"><span class="linenr"> 1: </span><span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/</span><span style="color: #a020f0;">bash</span>
<span class="linenr"> 2: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">changing the IFS value</span>
<span class="linenr"> 3: </span>IFS.OLD=$<span style="color: #a0522d;">IFS</span>
<span class="linenr"> 4: </span><span style="color: #a0522d;">IFS</span>=$<span style="color: #8b2252;">'\n'</span>
<span class="linenr"> 5: </span><span style="color: #a020f0;">for</span> entry<span style="color: #a020f0;"> in</span> $(<span style="color: #ff00ff;">cat</span> /etc/passwd)
<span class="linenr"> 6: </span><span style="color: #a020f0;">do</span>
<span class="linenr"> 7: </span>        <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"Values in $entry -"</span>
<span class="linenr"> 8: </span>        <span style="color: #a0522d;">IFS</span>=:
<span class="linenr"> 9: </span>        <span style="color: #a020f0;">for</span> value<span style="color: #a020f0;"> in</span> $<span style="color: #a0522d;">entry</span>
<span class="linenr">10: </span>        <span style="color: #a020f0;">do</span>
<span class="linenr">11: </span>                <span style="color: #483d8b;">echo</span> <span style="color: #8b2252;">"$value"</span>
<span class="linenr">12: </span>        <span style="color: #a020f0;">done</span>
<span class="linenr">13: </span><span style="color: #a020f0;">done</span>
<span class="linenr">14: </span><span style="color: #b22222;"># </span><span style="color: #b22222;">&#35813;&#33050;&#26412;&#20351;&#29992;&#20102;&#20004;&#20010;&#19981;&#21516;&#30340; IFS &#30340;&#20540;&#26469;&#35299;&#26512;&#25968;&#25454;&#65292;&#31532;&#19968;&#20010; IFS &#20540;&#35299;&#26512;&#20986; /etc/passwd &#25991;&#20214;&#20013;&#30340;&#21333;&#29420;&#30340;&#34892;&#65292;&#20869;&#37096; for &#24490;&#29615;&#25509;&#30528;&#23558; IFS &#30340;&#20540;&#20462;&#25913;&#20026;&#20882;&#21495;&#65292;&#20801;&#35768;&#20320;&#20174; /etc/passwd &#30340;&#34892;&#20013;&#35299;&#26512;&#20986;&#21333;&#29420;&#30340;&#20540;&#12290;</span>
</pre>
</div>
</div>
</li>
